In [5]:
import numpy as np
import pandas as pd
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [6]:
data

a  1    0.605357
   2   -1.727294
   3    0.653003
b  1   -1.378362
   3    0.312594
c  1    0.252744
   2    0.234857
d  2   -0.283772
   3   -0.151886
dtype: float64

In [7]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [8]:
data['a']

1    0.605357
2   -1.727294
3    0.653003
dtype: float64

In [9]:
data['b']

1   -1.378362
3    0.312594
dtype: float64

In [10]:
data['c']

1    0.252744
2    0.234857
dtype: float64

In [11]:
data[1]

-1.72729385229424

In [15]:
data['b':'d']

b  1   -1.378362
   3    0.312594
c  1    0.252744
   2    0.234857
d  2   -0.283772
   3   -0.151886
dtype: float64

In [18]:
data.loc[['b','c','d']]

b  1   -1.378362
   3    0.312594
c  1    0.252744
   2    0.234857
d  2   -0.283772
   3   -0.151886
dtype: float64

In [19]:
data.loc[:,2]

a   -1.727294
c    0.234857
d   -0.283772
dtype: float64

In [20]:
data.loc[:,1]

a    0.605357
b   -1.378362
c    0.252744
dtype: float64

In [21]:
data.unstack()

          1         2         3
a  0.605357 -1.727294  0.653003
b -1.378362       NaN  0.312594
c  0.252744  0.234857       NaN
d       NaN -0.283772 -0.151886

In [22]:
data.unstack().stack()

a  1    0.605357
   2   -1.727294
   3    0.653003
b  1   -1.378362
   3    0.312594
c  1    0.252744
   2    0.234857
d  2   -0.283772
   3   -0.151886
dtype: float64

In [60]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [61]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [62]:
frame.index.names=['key1','key2']

In [63]:
frame.columns.names=['state','color']

In [64]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [65]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [66]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [53]:
## 重排与分级排序

In [67]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [57]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [59]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [72]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [74]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [75]:
# 根据级别汇总统计

In [76]:
frame.sum(level=1)

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [77]:
frame.sum(level=0)

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [79]:
frame.sum(axis=1,level=0)

state      Ohio  Colorado
key1 key2
a    1        1         2
     2        7         5
b    1       13         8
     2       19        11

In [80]:
# 使用DF的列进行索引

In [81]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['One','One','One','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [82]:
frame

   a  b    c  d
0  0  7  One  0
1  1  6  One  1
2  2  5  One  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [83]:
frame2=frame.set_index(['c','d'])

In [84]:
frame2

       a  b
c   d
One 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [85]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
One 0  0  7  One  0
    1  1  6  One  1
    2  2  5  One  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [86]:
frame2.reset_index()

     c  d  a  b
0  One  0  0  7
1  One  1  1  6
2  One  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [94]:

df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [95]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'], 'data1':range(7)})

In [96]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [97]:
# 索引上的合并

In [99]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})
right1=pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [101]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [102]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN